Afas.AfComply.UI/Code/XMLTemplates/SecurityHeader.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope
  xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:us:gov:treasury:irs:ext:aca:air:ty17"
  xmlns:urn1="urn:us:gov:treasury:irs:common" xmlns:urn2="urn:us:gov:treasury:irs:msg:acabusinessheader"
  xmlns:urn3="urn:us:gov:treasury:irs:msg:acasecurityheader"
  xmlns:urn4="urn:us:gov:treasury:irs:msg:irsacabulkrequesttransmitter">
  <soapenv:Header>
    <wsse:Security
      xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ds:Signature Id="SIG-5E296AE8A7CF28ACCC14774977964791018"
        xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod
            Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#WithComments" />
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
          <ds:Reference Id="Timestamp" URI="#TS-5E296AE8A7CF28ACCC14774977964731014">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <InclusiveNamespaces PrefixList="wsse oas soapenv urn urn1 urn2 urn3 urn4"
                xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#sha384" />
            <ds:DigestValue>BPq4r/EWiKilMj1lPmdMRUGDnooF51hg9+1qvdWcas/iQ/1ahgdY3lRGbjoQlnAV</ds:DigestValue>
          </ds:Reference>
          <ds:Reference Id="ACABusinessHeader" URI="#id-8C57FD77752E41888214739626212831137">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <InclusiveNamespaces PrefixList="oas soapenv urn1 urn2 urn3 urn4"
                xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#sha384" />
            <ds:DigestValue>
              TpCkzZ2k2ZJC+zOuufjKfmVazGIkO+y81M8UuvUicNWql7GWCkgZXGWwF9TlRhQ6
            </ds:DigestValue>
          </ds:Reference>
          <ds:Reference Id="ACABulkRequestTransmitterStatusDetailRequest" URI="#id-8C57FD77752E41888214739626212831138">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                <InclusiveNamespaces PrefixList="oas soapenv urn urn1 urn3 urn4"
                xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </ds:Transform>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#sha384" />
            <ds:DigestValue>
              M+eEf3srQ3BxFKs1du5joDEl1y8nT7Rg9t+TPvypSnFOuSDzHflX9m1qJm46iedR
            </ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue></ds:SignatureValue>
        <ds:KeyInfo Id="KI-5E296AE8A7CF28ACCC14774977964771016">
          <wsse:SecurityTokenReference wsu:Id="STR-5E296AE8A7CF28ACCC14774977964771017">
            <wsse:KeyIdentifier
              EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
              ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">
                MIIHojCCBoqgAwIBAgIESoZHzDANBgkqhkiG9w0BAQsFADCBjjELMAkGA1UEBhMCdXMxGDAWBgNVBAoTD3Uucy4gZ292ZXJubWVudDEjMCEGA1UE
                CxMaZGVwYXJ0bWVudCBvZiB0aGUgdHJlYXN1cnkxIjAgBgNVBAsTGUNlcnRpZmljYXRpb24gQXV0aG9yaXRpZXMxHDAaBgNVBAsTE0RldmVsb3Bt
                ZW50IE9DSU8gQ0EwHhcNMTUwNDI0MTg0NjIwWhcNMTgwNDI0MTkxNjIwWjCBojELMAkGA1UEBhMCVVMxGDAWBgNVBAoTD1UuUy4gR292ZXJubWVu
                dDEjMCEGA1UECxMaRGVwYXJ0bWVudCBvZiB0aGUgVHJlYXN1cnkxITAfBgNVBAsTGEludGVybmFsIFJldmVudWUgU2VydmljZTEQMA4GA1UECxMH
                RGV2aWNlczEfMB0GA1UEAxMWdGVzdGlzcy5hY2EuYWZzaWVwLm5ldDCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAJXvXWJQJUoaHS3M
                AVPYpjLDlXlsHRo+QKtx/h4kfrW7vldHODKJaBupypVKAt05aGcso3zBRVUTy+IO/Of7LnRwDcEQZaZl9pbTIwaE+2eDUL/p9u5CTCUDK6G1ik8W
                mF7KTw7ANBXnMhZQ0bLcjvu9l5FyXrPGyO/E0X6A05CbnG5wRmkyjzjQAFkOLAc9eEv4zBWFGAwfuxjjl5RvNWmP0u+/lhuojLXvHzJanD5ejDy1
                xqos4n8NCjwLjaudgCxyBpfeLXZvhb2kHCndIK9ZwI+zaA6QSsX9dMOAOrljEn7rT5W/G3nXDAeXH+UisttmjxaJLPmVVZwo6pv3nikCAwEAAaOC
                42
                A/AwggPsMA4GA1UdDwEB/wQEAwIFoDAXBgNVHSAEEDAOMAwGCmCGSAFlAwIBMDgwEQYJYIZIAYb4QgEBBAQDAgZAMBMGA1UdJQQMMAoGCCsGAQUF
                BwMBMIIBJAYIKwYBBQUHAQEEggEWMIIBEjAkBggrBgEFBQcwAYYYaHR0cDovL2Rldm9jc3AudHJlYXMuZ292MDYGCCsGAQUFBzAChipodHRwOi8v
                ZGV2cGtpLnRyZWFzLmdvdi9kZXZ0b2NhX2VlX2FpYS5wN2MwgbEGCCsGAQUFBzAChoGkbGRhcDovL2RldmxkYXAudHJlYXMuZ292L291PURldmVs
                b3BtZW50JTIwT0NJTyUyMENBLG91PUNlcnRpZmljYXRpb24lMjBBdXRob3JpdGllcyxvdT1EZXBhcnRtZW50JTIwb2YlMjB0aGUlMjBUcmVhc3Vy
                eSxvPVUuUy4lMjBHb3Zlcm5tZW50LGM9VVM/Y0FDZXJ0aWZpY2F0ZTtiaW5hcnkwPAYDVR0RBDUwM4EVQWxleC5KLlJ1c2hpbkBpcnMuZ292gRpp
                dC5hY2EuaWMucmx0cy5pc3JAaXJzLmdvdjCCAakGA1UdHwSCAaAwggGcMC6gLKAqhihodHRwOi8vZGV2cGtpLnRyZWFzLmdvdi9EZXZfT0NJT19D
                QTMuY3JsMIIBaKCCAWSgggFgpIGhMIGeMQswCQYDVQQGEwJ1czEYMBYGA1UEChMPdS5zLiBnb3Zlcm5tZW50MSMwIQYDVQQLExpkZXBhcnRtZW50
                IG9mIHRoZSB0cmVhc3VyeTEiMCAGA1UECxMZQ2VydGlmaWNhdGlvbiBBdXRob3JpdGllczEcMBoGA1UECxMTRGV2ZWxvcG1lbnQgT0NJTyBDQTEO
                MAwGA1UEAxMFQ1JMMTCGgblsZGFwOi8vZGV2bGRhcC50cmVhcy5nb3YvY249Q1JMMTAsb3U9RGV2ZWxvcG1lbnQlMjBPQ0lPJTIwQ0Esb3U9Q2Vy
                dGlmaWNhdGlvbiUyMEF1dGhvcml0aWVzLG91PWRlcGFydG1lbnQlMjBvZiUyMHRoZSUyMHRyZWFzdXJ5LG89dS5zLiUyMGdvdmVybm1lbnQsYz11
                cz9jZXJ0aWZpY2F0ZVJldm9jYXRpb25MaXN0O2JpbmFyeTArBgNVHRAEJDAigA8yMDE1MDQyNDE4NDYyMFqBDzIwMTgwNDI0MTkxNjIwWjAfBgNV
                HSMEGDAWgBRw0GQ6fo2NpZ1h16+Osjhe4NK+WzAdBgNVHQ4EFgQUr9hyDVir2ZjzOuuovLKVPrdnu74wGQYJKoZIhvZ9B0EABAwwChsEVjguMQMC
                A6gwDQYJKoZIhvcNAQELBQADggEBAHXgodB2YZyc0MP1+ps58R0ICGPiVUaX9+tt8+YlFS/L0aJh7KaWYrN6BiH4kTWeIi3kS3Y/7qKymUBh7gWx
                NAo2CLnpJ9QzIpPgnEUXZr7uRmyJXDFLZxUFiubiCJrWrtHZTGQTTKq3GuxYugnSHmqK+sFxSo5sz/jCbxQQ+bLE7jKFjLEvmcfGSFlSmyHjIW0K
                EfEERUZwlDsxBtZ7kXj0TMm8X1Uzkc4opw9zvWHNLNossjiaRqWrG98LEYnz4FMxKwRYXsvftuAMXxGRfMy0FZjWXeGV1Vg/LElnigL2qRgDn6G2
                iOA6TpEG4VbUaCdrKsqXNDKCcYUQMldmBj8=
            </wsse:KeyIdentifier>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
      <wsu:Timestamp wsu:Id="TS-5E296AE8A7CF28ACCC14774977964731014">
        <wsu:Created>2016-10-26T16:03:16.473Z</wsu:Created>
        <wsu:Expires>2016-10-26T18:33:16.473Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
    <urn:ACATransmitterManifestReqDtl
    wsu:Id="id-8C57FD77752E41888214739626212831137"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <urn:PaymentYr>2016</urn:PaymentYr>
      <urn:PriorYearDataInd>0</urn:PriorYearDataInd>
      <urn1:EIN>000000000</urn1:EIN>
      <urn:TransmissionTypeCd>O</urn:TransmissionTypeCd>
      <urn:TestFileCd>T</urn:TestFileCd>
      <urn:TransmitterNameGrp>
        <urn:PersonFirstNm>Person First Nm</urn:PersonFirstNm>
        <urn:PersonLastNm>Person Last Nm</urn:PersonLastNm>
        <urn:BusinessNameLine1Txt>&amp;</urn:BusinessNameLine1Txt>
        <urn:BusinessNameLine2Txt>&amp;</urn:BusinessNameLine2Txt>
      </urn:TransmitterNameGrp>
      <urn:CompanyInformationGrp>
        <urn:CompanyNm>test</urn:CompanyNm>
        <urn:MailingAddressGrp>
          <urn:USAddressGrp>
            <urn:AddressLine1Txt>O</urn:AddressLine1Txt>
            <urn1:CityNm>A</urn1:CityNm>
            <urn:USStateCd>AL</urn:USStateCd>
            <urn1:USZIPCd>00000</urn1:USZIPCd>
            <urn1:USZIPExtensionCd>0000</urn1:USZIPExtensionCd>
          </urn:USAddressGrp>
        </urn:MailingAddressGrp>
        <urn:ContactNameGrp>
          <urn:PersonFirstNm>Person First Nm</urn:PersonFirstNm>
          <urn:PersonLastNm>Person Last Nm</urn:PersonLastNm>
        </urn:ContactNameGrp>
        <urn:ContactPhoneNum>0000000000</urn:ContactPhoneNum>
      </urn:CompanyInformationGrp>
      <urn:VendorInformationGrp>
        <urn:VendorCd>I</urn:VendorCd>
        <urn:ContactNameGrp>
          <urn:PersonFirstNm>Person First Nm</urn:PersonFirstNm>
          <urn:PersonLastNm>Person Last Nm</urn:PersonLastNm>
        </urn:ContactNameGrp>
        <urn:ContactPhoneNum>0000000000</urn:ContactPhoneNum>
      </urn:VendorInformationGrp>
      <urn:TotalPayeeRecordCnt>1</urn:TotalPayeeRecordCnt>
      <urn:TotalPayerRecordCnt>1</urn:TotalPayerRecordCnt>
      <urn:SoftwareId>12345</urn:SoftwareId>
      <urn:FormTypeCd>1094/1095B</urn:FormTypeCd>
      <urn1:BinaryFormatCd>application/xml</urn1:BinaryFormatCd>
      <urn1:ChecksumAugmentationNum>00000000000000000000000000000000</urn1:ChecksumAugmentationNum>
      <urn1:AttachmentByteSizeNum>100</urn1:AttachmentByteSizeNum>
      <urn:DocumentSystemFileNm>1094B_Request_CD000_42830130T003614746Z.xml</urn:DocumentSystemFileNm>
    </urn:ACATransmitterManifestReqDtl>
    <urn2:ACABusinessHeader wsu:Id="id-8C57FD77752E41888214739626212831138"
      xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <urn:UniqueTransmissionId>
        SRIKTEST-c023-4c48-a01a-000000000000:SYS12:CD000::T
      </urn:UniqueTransmissionId>
      <urn1:Timestamp>2016-10-26T12:03:16Z</urn1:Timestamp>
    </urn2:ACABusinessHeader>
    <urn3:ACASecurityHeader />
  </soapenv:Header>
  <soapenv:Body>
    <urn4:ACABulkRequestTransmitter version="1.0">
      <urn1:BulkExchangeFile>
        <n1:Form109495CTransmittalUpstream
            xmlns="urn:us:gov:treasury:irs:ext:aca:air:ty16"
            xmlns:irs="urn:us:gov:treasury:irs:common"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:n1="urn:us:gov:treasury:irs:msg:form1094-1095Ctransmitterupstreammessage"
            xsi:schemaLocation="urn:us:gov:treasury:irs:msg:form1094-1095Ctransmitterupstreammessage IRS-Form1094-1095CTransmitterUpstreamMessage.xsd">
          
        </n1:Form109495CTransmittalUpstream>
      </urn1:BulkExchangeFile>
    </urn4:ACABulkRequestTransmitter>
  </soapenv:Body>
</soapenv:Envelope>
